In [9]:
import numpy as np
import pandas as pd
import sklearn

In [15]:
Warangal_Population=pd.read_csv("Warangal_Population.csv")
Nizamabad_Population=pd.read_csv("Nizamabad_Population.csv")
Khammam_Population=pd.read_csv("Khammam_Population.csv")
Karimnagar_Population=pd.read_csv("Karimnagar_Population.csv")

In [16]:
Warangal_Population.head(5)

         date   Population   Annual Change
0  31-12-1950       130000             NaN
1  31-12-1951       134000            3.08
2  31-12-1952       136000            1.49
3  31-12-1953       138000            1.47
4  31-12-1954       140000            1.45

In [17]:
Nizamabad_Population.head(5)

         date   Population   Annual Change
0  31-12-1950        53000             NaN
1  31-12-1951        56000            5.66
2  31-12-1952        58000            3.57
3  31-12-1953        60000            3.45
4  31-12-1954        62000            3.33

In [18]:
Khammam_Population.head(5)

         date   Population   Annual Change
0  31-12-1950        28000             NaN
1  31-12-1951        28000            0.00
2  31-12-1952        29000            3.57
3  31-12-1953        30000            3.45
4  31-12-1954        31000            3.33

In [19]:
Karimnagar_Population.head(5)

         date   Population   Annual Change
0  31-12-1950        23000             NaN
1  31-12-1951        24000            4.35
2  31-12-1952        25000            4.17
3  31-12-1953        25000            0.00
4  31-12-1954        26000            4.00

In [28]:
Warangal_Population[' Population']

0      130000
1      134000
2      136000
3      138000
4      140000
       ...
81    1237000
82    1264000
83    1292000
84    1319000
85    1347000
Name:  Population, Length: 86, dtype: int64

In [47]:
Population=pd.concat([Warangal_Population[' Population'], Nizamabad_Population[' Population'], Khammam_Population[' Population'], Karimnagar_Population[' Population']], axis=1)

In [48]:
Population.size

344